Documents/ОформлениеПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ОформлениеПодписки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наличные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безналичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПодписки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокПодписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Издательство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Издательство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеКорреспонденции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Корреспонденция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОформлениеПодписки/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОформлениеПодписки.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОформлениеПодписки.Безналичный,
	|	ОформлениеПодписки.Дата,
	|	ОформлениеПодписки.Клиент,
	|	ОформлениеПодписки.Наличные,
	|	ОформлениеПодписки.Номер,
	|	ОформлениеПодписки.Сотрудник,
	|	ОформлениеПодписки.СрокПодписки,
	|	ОформлениеПодписки.ТЧ1.(
	|		НомерСтроки,
	|		Издательство,
	|		НазваниеКорреспонденции,
	|		Стоимость
	|	)
	|ИЗ
	|	Документ.ОформлениеПодписки КАК ОформлениеПодписки
	|ГДЕ
	|	ОформлениеПодписки.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ1Шапка = Макет.ПолучитьОбласть("ТЧ1Шапка");
	ОбластьТЧ1 = Макет.ПолучитьОбласть("ТЧ1");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ1Шапка);
		ВыборкаТЧ1 = Выборка.ТЧ1.Выбрать();
		Пока ВыборкаТЧ1.Следующий() Цикл
			ОбластьТЧ1.Параметры.Заполнить(ВыборкаТЧ1);
			ТабДок.Вывести(ОбластьТЧ1, ВыборкаТЧ1.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
